/********************************************************************************
Copyright (C), Sinowealth Electronic. Ltd.
Author: 	Sino
Version: 	V0.0
Date: 		2020/03/02
History:
	V0.0		2020/03/02		 Preliminary
********************************************************************************/
#include "HEAD.H"


///*************************************************************************************************
//* 函数名: HAL_UART_RxCpltCallback
//* 参  数: 无
//* 返回值: 无
//* 描  述: Uart中断回调函数（接收数据）
//*************************************************************************************************/
//void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart)
//{
//    if(huart == &huart2)
//    {
//        if(ucUart1RxBufPT >= 255)
//        {
//        	ucUart1RxBufPT = 0;
//        }
//        else
//        {
//			UartReceive();
//        }
//    }
//}

///*************************************************************************************************
//* 函数名: HAL_UART_RxCpltCallback
//* 参  数: 无
//* 返回值: 无
//* 描  述: Uart中断回调函数（发送数据）
//*************************************************************************************************/
//void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart)
//{
//    UartTransmit();
//}
